target/test-classes/xml/sws/maintainpayment/TC32669_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
    <soapenv:Header/>
    <soapenv:Body>
        <sel:maintainPaymentRequest>
            <sel:externalSystemID>NETCALL</sel:externalSystemID>
            <sel:action>ADHOC_PAYMENT</sel:action>
            <sel:accountNumber>$accountNumber$</sel:accountNumber>
            <sel:ongoingPaymentMethod>CARD</sel:ongoingPaymentMethod>
            <sel:amount>22.51</sel:amount>
            <sel:externalReference>MP-22</sel:externalReference>
            <sel:cardDetails>
                <sel:useExistingCard>true</sel:useExistingCard>
                <sel:cvv>123</sel:cvv>
            </sel:cardDetails>
            <sel:directDebit>
                <sel:bankName>Barclays</sel:bankName>
                <sel:sortCode>111281</sel:sortCode>
                <sel:accountNumber>00039256</sel:accountNumber>
                <sel:accountName>MP-22</sel:accountName>
            </sel:directDebit>
        </sel:maintainPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>